tutorials/A.Jacobsen_2026/CaseBB/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

touch open.foam

restore0Dir

runApplication blockMesh

runApplication topoSet

runApplication setFields

runApplication $(getApplication)

#------------------------------------------------------------------------------
