tutorials/A.Jacobsen_2026/CaseBB/system/set1.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      set1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set1{
type sets;

interpolationScheme cellPoint;
setFormat raw;
fields
	(
 		p_rgh C_H2.electrolyte C_H2.gas C_O2.electrolyte C_O2.gas C_OH.electrolyte C_H2O.electrolyte U Ue UPe UNe eta J alpha.gas rhod rho Psi_si_O2 Psi_si_H2
 	);
 	writeControl    timeStep;
	writeInterval   200;

	writeFields     true;
	log             false;
sets
 	(
		YLineEnd
		{
			type uniform;
			axis	y;
			start	(XEnd 0 ZMid);
			end	(XEnd YTOP ZMid);
			nPoints	60;
		//	triangulate true;
		}
		YLineMid
		{
			type uniform;
			axis	y;
			start	(XMid 0 ZMid);
			end	(XMid YTOP ZMid);
			nPoints	60;
		//	triangulate true;
		}
		YLineEarly
		{
			type uniform;
			axis	y;
			start	(XStart 0 ZMid);
			end	(XStart YTOP ZMid);
			nPoints	60;
		//	triangulate true;
		}

   );
		
}    
  
// ************************************************************************* //


