tutorials/A.Jacobsen_2026/CaseBB/system/setFieldsDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

tPe		TPEe-3;
tDi		TDIe-3;
tNe		TNEe-3;
cellLength	LCe-3;
cellDepth	WCe-3;
nD		0.025;



t2 #eval #{ $tPe+$tDi #};
t3 #eval #{ $tPe+$tDi+$tNe #};

V1Ne1 #eval #{ $t2+$tNe*$nD #};
V1Ne2 #eval #{ $t3-$tNe*$nD #};
V1Pe1 #eval #{ $tPe*$nD #};
V1Pe2 #eval #{ $tPe-$tPe*$nD #};


defaultFieldValues
(
    //volScalarFieldValue sigma_s 1000
    volScalarFieldValue r_p RPE
    volScalarFieldValue Ne 0
    volScalarFieldValue Pe 0
    volScalarFieldValue Mem 0
    volScalarFieldValue InRegion 0
    volScalarFieldValue eps EPSE
    volScalarFieldValue	tau 1.2
    volScalarFieldValue PeC 0
    volScalarFieldValue NeC 0
);

regions
(
    zoneToCell
    {
    	zone     positiveChannel;
    	
    	fieldValues
    	(
    		volScalarFieldValue PeC 1
    		volScalarFieldValue eps 0.999
    	);
    }
    zoneToCell
    {
    	zone     negativeChannel;
    	
    	fieldValues
    	(
    		volScalarFieldValue NeC 1
    		volScalarFieldValue eps 0.999
    	);
    }
    boxToCell
    {
    	box (0 $tPe 0) ($cellLength  $t2 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue tau TAUS
    	);
    }
    boxToCell
    {
    	box (0 0 0) ($cellLength $tPe $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue Pe 1
    	);
    }
    boxToCell
    {
    	box (0 $t2 0) ($cellLength  $t3 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue Ne 1
    	);
    }
    boxToCell
    {
    	box (0 $tPe 0) ($cellLength  $t2 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue Mem 1
    	);
    }
    
    /*boxToCell
    {
    	box (0 0 0) ($L0  $t3 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue InRegion 1
    	);
    }*/

    
    boxToCell
    {
    	box (0.0 $tPe 0) ($cellLength  $t2 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue eps EPSS
    	);
    }
    boxToCell
    {
    	box (0.0 $tPe 0) ($cellLength  $t2 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue r_p RPS
    	);
    }
    //Chemical properties HER
    boxToCell
    {
    	box (0.0 $t2 0) ($cellLength  $t3 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue s_OH 2
    	);
    }
    boxToCell
    {
    	box (0.0 $t2 0) ($cellLength  $t3 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue s_H2O -2
    	);
    }
    boxToCell
    {
    	box (0.0 $t2 0) ($cellLength  $t3 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue s_H2 1
    	);
    }
    //Chemical properties OER
    boxToCell
    {
    	box (0.0 0 0) ($cellLength  $tPe $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue s_OH 2
    	);
    }
    boxToCell
    {
    	box (0.0 0 0) ($cellLength  $tPe $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue s_H2O -1
    	);
    }
    boxToCell
    {
    	box (0.0 0 0) ($cellLength  $tPe $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue s_O2 -0.5
    	);
    }
    
    
    
    /*   boxToCell
    {
    	box (0 $tPe 0) ($cellLength  $t2 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue alpha.gas 0
    	);
    }
        boxToCell
    {
    	box (0 $tPe 0) ($cellLength  $t2 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue C_H2.gas 0
    	);
    }
        boxToCell
    {
    	box (0 $tPe 0) ($cellLength  $t2 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue C_O2.gas 0
    	);
    }
        boxToCell
    {
    	box (0 $tPe 0) ($cellLength  $t2 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue C_H2O.gas 0
    	);
    }*/
);


// ************************************************************************* //
